app/controllers/couriers_controller.rb

  def create
    @courier = Courier.new(courier_create_params)

    respond_to do |format|
      if @courier.save
---
INSERT INTO `couriers` (`mobile`, `encrypted_password`, `name`, `created_at`, `updated_at`, `address`, `range`) VALUES ('333', '111111', '', '2017-04-15 05:34:52', '2017-04-15 05:34:52', 'jiaodadonglu', '3')

  def login
    @courier = Courier.where(["mobile = ? and encrypted_password = ?", params[:mobile], params[:encrypted_password]])

    respond_to do |format|
      if @courier.empty?
---
SELECT `couriers`.* FROM `couriers` WHERE (mobile = '16126207@bjtu.edu.cn' and encrypted_password = '111111')
SELECT COUNT(*) FROM `couriers` WHERE (mobile = '007' and encrypted_password = '1111111')